server/app/controllers/prescriptions_controller.rb

INSERT INTO "prescriptions" ("user_id", "name", "dose", "count_goal", "recurring_period", "taken", "goal_is_met", "start_date", "end_date", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
	def create
		new_prescription = current_user.prescriptions.create!(rx_params)

SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "prescriptions" SET "name" = $1, "dose" = $2, "count_goal" = $3, "recurring_period" = $4, "taken" = $5, "start_date" = $6, "end_date" = $7, "notes" = $8, "updated_at" = $9 WHERE "prescriptions"."id" = $10
---
	def update
		prescription = Prescription.find(params[:id])
		prescription.update!(rx_params)

SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "prescriptions" WHERE "prescriptions"."id" = $1  [["id", 14]]
---
	def destroy
		prescription = Prescription.find(params[:id])
		prescription.destroy!