server/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "ark"], ["password_digest", "$2a$10$nqj.n6HM1OQHoy6hD8l2IOWT4egkWr9WJLwaspwK1U6Qt6Ylg5MVy"], ["created_at", "2018-03-13 15:32:08.935366"], ["updated_at", "2018-03-13 15:32:08.935366"]]
---
	def create
		username = params[:username]
		password = params[:password]

		new_user = User.create({
		  password: password,
		  username: username
		})

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ark"], ["LIMIT", 1]]
---
	def login
		username = params[:username]
		password = params[:password]

		user = User.find_from_credentials username, password