app/controllers/prescriptions_controller.rb

SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."user_id" = $1  [["user_id", 1]]
---
	def index
		puts "--->in prescriptions#index"
		puts "--->uid: #{current_user.id}"
		prescriptions = current_user.prescriptions
		prescriptions.each do |rx|

SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "prescriptions" SET "taken" = $1, "goal_is_met" = $2, "last_taken" = $3, "updated_at" = $4 WHERE "prescriptions"."id" = $5  [["taken", 2], ["goal_is_met", "t"], ["last_taken", "2018-03-16 13:54:25.902887"], ["updated_at", "2018-03-16 13:54:25.904618"], ["id", 32]]
---
	def take_pill
		prescription = Prescription.find(params[:id])
		count = prescription[:taken] + 1
		time = DateTime.now

		if count >= prescription[:count_goal]
			prescription.update!(taken: prescription[:count_goal], goal_is_met: true, last_taken: time)

INSERT INTO "prescriptions" ("user_id", "name", "dose", "count_goal", "recurring_period", "taken", "goal_is_met", "start_date", "end_date", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
	def create
		new_prescription = current_user.prescriptions.create!(rx_params)

SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "prescriptions" SET "name" = $1, "count_goal" = $2, "goal_is_met" = $3, "updated_at" = $4 WHERE "prescriptions"."id" = $5  [["name", "New Pills"], ["count_goal", 5], ["goal_is_met", "f"], ["updated_at", "2018-03-16 15:33:00.592204"], ["id", 34]]
---
	def update
		prescription = Prescription.find(params[:id])
		prescription.update!(rx_params)

SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "prescriptions" WHERE "prescriptions"."id" = $1  [["id", 25]]
---
	def destroy
		prescription = Prescription.find(params[:id])
		prescription.destroy!